{
  "backend/main.mo": "Motoko canister managing customers and invoices with CRUD operations and payment tracking.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files for reference or tooling.",
  "frontend/index.css": "Tailwind-based global styles defining honey/amber themed CSS variables for light and dark modes.",
  "frontend/index.html": "Frontend HTML entry with process.env safety shim and default Internet Identity URL.",
  "frontend/src/api/backendClient.ts": "Backend client helpers including error normalization and exported backend interface type.",
  "frontend/src/api/queryKeys.ts": "React Query key definitions for customers and invoices.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router and wrapping routes with error and auth bootstrap guards.",
  "frontend/src/components/AppShell.tsx": "Layout shell with header, navigation, main content area, and footer branding.",
  "frontend/src/components/AsyncState.tsx": "Reusable UI component for loading, error, and empty states with retry support.",
  "frontend/src/components/BootstrapGate.tsx": "Handles Internet Identity initialization states and shows AsyncState on errors or loading.",
  "frontend/src/components/BrandHeader.tsx": "Brand header showing logo and business name with amber gradient theme.",
  "frontend/src/components/StartupErrorBoundary.tsx": "React error boundary that catches startup errors and shows a reload prompt.",
  "frontend/src/features/customers/CustomerForm.tsx": "Form for creating a customer with validation and mutation submission.",
  "frontend/src/features/customers/CustomersPage.tsx": "Customers listing page with add-customer dialog and table display.",
  "frontend/src/features/customers/queries.ts": "React Query hooks for fetching and mutating customer data via actor backend.",
  "frontend/src/features/customers/types.ts": "Type definitions and helpers for customer data and form mapping.",
  "frontend/src/features/invoices/InvoiceDetailPage.tsx": "Invoice detail view showing invoice data, customer info, and payment recording.",
  "frontend/src/features/invoices/InvoiceForm.tsx": "Form for creating invoices, selecting customers, editing line items, and submitting.",
  "frontend/src/features/invoices/InvoiceLineItemsEditor.tsx": "Editor component for managing invoice line items, including totals and item CRUD.",
  "frontend/src/features/invoices/InvoicesPage.tsx": "Invoice list page showing all invoices with customer names, totals, and a dialog to create new invoices.",
  "frontend/src/features/invoices/queries.ts": "React Query hooks for fetching invoices and customers and mutating invoice creation and payments via the backend actor.",
  "frontend/src/features/invoices/types.ts": "Shared invoice types plus helpers for currency parsing, formatting, and calculating line and invoice totals.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user’s identity and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, exposing identity, login, logout, and status within a React context provider.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables defining light/dark themes with warm color palettes.",
  "frontend/src/main.tsx": "Root entry initializing React, React Query, Internet Identity provider, and global styles before rendering the app.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, typography, animations, and extended theme settings.",
  "project_state.json": "Project metadata describing the scaffolded ICP app, listing existing backend, frontend, authentication, UI, and feature modules with their versions and descriptions."
}