{
  "backend/main.mo": "Motoko canister implementing customer, service, invoice, photo, and user profile storage with access control and discount-aware invoice total calculation.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing components, pages, hooks, and utilities.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark color tokens and global styles.",
  "frontend/index.html": "HTML entrypoint configuring favicon assets, bootstrap environment shim, and mounting the main React app.",
  "frontend/src/api/backendClient.ts": "Utility for normalizing backend errors into user‑friendly messages and exporting the backend interface type.",
  "frontend/src/api/queryKeys.ts": "Centralized React Query key definitions for customers, invoices, and services.",
  "frontend/src/App.tsx": "Application router setup defining root layout, theme provider, and routes for landing, customers, invoices, services, and details.",
  "frontend/src/components/AppShell.tsx": "Layout shell providing header, nav buttons, main content container, and footer with branding.",
  "frontend/src/components/AsyncState.tsx": "Reusable component handling loading, error, and empty states using consistent card UI.",
  "frontend/src/components/BootstrapGate.tsx": "Wrapper that blocks rendering until Internet Identity initialization completes, showing loading or error states.",
  "frontend/src/components/BrandHeader.tsx": "Renders a header with the business logo and branding text.",
  "frontend/src/components/StartupErrorBoundary.tsx": "React error boundary that displays a styled error card and reload option on startup failure.",
  "frontend/src/config/invoiceAssets.ts": "Exports static paths and metadata for invoice logo and watermark images.",
  "frontend/src/config/invoiceBranding.ts": "Provides static business address, payment instructions, and optional text number for invoices.",
  "frontend/src/features/customers/CustomerDetailDialog.tsx": "Dialog showing customer details with loading, error, and not-found states using useCustomer.",
  "frontend/src/features/customers/CustomerForm.tsx": "Form for creating or editing a customer, handling validation, submission, and toast feedback.",
  "frontend/src/features/customers/CustomersPage.tsx": "Customers list page with dialogs for adding, viewing, and editing customers and async state handling.",
  "frontend/src/features/customers/queries.ts": "React Query hooks for fetching, creating, and updating customers through the backend actor.",
  "frontend/src/features/customers/types.ts": "Type definitions for customer data and helper to convert a Customer to form data.",
  "frontend/src/features/invoices/blobStorage.ts": "Utility for uploading image files as data URLs and returning displayable blob URLs.",
  "frontend/src/features/invoices/InvoiceDetailPage.tsx": "Invoice detail page allowing payment recording, photo management, invoice editing, and viewing customer info.",
  "frontend/src/features/invoices/InvoiceForm.tsx": "Form component for creating and editing invoices, handling validation, submission, and customer/line item selection.",
  "frontend/src/features/invoices/InvoiceLineItemsEditor.tsx": "Editor UI for managing invoice line items, including service selection, quantity, pricing, discounts, and totals.",
  "frontend/src/features/invoices/InvoicePhotoPreviewDialog.tsx": "Dialog that displays a full-size preview of an invoice photo using a provided blob URL.",
  "frontend/src/features/invoices/InvoicePhotosSection.tsx": "Section for uploading, viewing, previewing, and removing invoice photos with validation and progress tracking.",
  "frontend/src/features/invoices/InvoicesPage.tsx": "Main invoices page listing invoices with create and edit dialogs, authentication checks, and invoice table display.",
  "frontend/src/features/invoices/photoTypes.ts": "Types and validators for image uploads, including supported formats and file size limits.",
  "frontend/src/features/invoices/queries.ts": "React Query hooks for fetching, creating, and updating invoices and customers, including form-to-backend data mapping.",
  "frontend/src/features/invoices/SignInRequiredState.tsx": "UI state prompting the user to sign in via Internet Identity before accessing invoices.",
  "frontend/src/features/invoices/types.ts": "Defines invoice-related form types and utility functions for currency, percentage parsing, and line total calculations.",
  "frontend/src/features/landing/LandingPage.tsx": "Renders the landing page with navigation cards to customers, invoices, and services sections.",
  "frontend/src/features/services/importParsing.ts": "Parses CSV/TSV service rows, validates required fields and prices, and returns structured ParsedServiceRow entries.",
  "frontend/src/features/services/queries.ts": "Provides React Query hooks to list, fetch, create, update, and bulk‑import services using the backend actor.",
  "frontend/src/features/services/ServiceBulkImportDialog.tsx": "Implements a dialog for bulk importing services via pasted text or file upload, with preview, validation, and submission.",
  "frontend/src/features/services/ServiceEditForm.tsx": "Provides a form for editing an existing service, including validation and update submission.",
  "frontend/src/features/services/ServiceEditPage.tsx": "Fetches service details and displays the edit form within a page layout with navigation controls.",
  "frontend/src/features/services/ServiceItemForm.tsx": "Form component for creating a new service with validation and submission handling.",
  "frontend/src/features/services/ServicesPage.tsx": "Displays the list of services with add, edit, and bulk import options using dialogs and tables.",
  "frontend/src/features/services/types.ts": "Defines service form and import row types plus currency parsing and formatting utilities.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current identity and invalidates dependent queries on changes.",
  "frontend/src/hooks/useAuthStatus.ts": "Exposes whether the user is authenticated via Internet Identity along with initialization state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, providing identity state, login, logout, and context utilities.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables for light/dark modes, and invoice watermark styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and sessionStorage parameters.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing the app’s overall state, feature list, and versioned capabilities for a Motoko backend and React/Vite frontend."
}