{
  "backend/main.mo": "Defines backend actor with storage, access control, and types for customers, invoices, services, photos, and work orders, plus query methods for user profiles.",
  "feature_evidence.json": "Feature evidence report describing files, components, and tests related to deployment error handling and retry support.",
  "frontend-file-summaries.txt": "Lists pre‑generated summaries of numerous frontend files describing their roles in routing, UI, data handling, and diagnostics.",
  "frontend/index.css": "Tailwind CSS setup defining color tokens and theming variables for light and dark modes.",
  "frontend/index.html": "HTML entry point with bootstrap shims, default Internet Identity URL, favicon links, and React root mount.",
  "frontend/src/api/backendClient.ts": "Provides error normalization utilities detecting stopped-canister and authorization errors, producing structured AppError objects with technical details.",
  "frontend/src/api/queryKeys.ts": "Defines React Query cache keys for customers, invoices, services, and work orders.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and wraps the app with theming, error boundary, bootstrap gate, and AppShell.",
  "frontend/src/components/AppShell.tsx": "Main layout with header, navigation buttons for all sections, content wrapper, and footer branding.",
  "frontend/src/components/AsyncState.tsx": "Provides a wrapper component to display loading, error (with technical details), empty, or content states.",
  "frontend/src/components/BootstrapGate.tsx": "Blocks rendering until Internet Identity initialization completes, showing loading or error via AsyncState.",
  "frontend/src/components/BrandHeader.tsx": "Renders the application's branded header with logo, title, and tagline.",
  "frontend/src/components/StartupErrorBoundary.tsx": "A React error boundary that catches startup errors and displays details with an option to copy technical info.",
  "frontend/src/config/invoiceAssets.ts": "Exports paths and metadata for invoice logo and watermark assets.",
  "frontend/src/config/invoiceBranding.ts": "Defines static business address, payment instructions, and optional text number for invoice branding.",
  "frontend/src/features/customers/CustomerDetailDialog.tsx": "Dialog component that loads and displays customer details with loading, error, and not-found states.",
  "frontend/src/features/customers/CustomerForm.tsx": "Form component for creating or updating customer records with validation and mutation handling.",
  "frontend/src/features/customers/CustomersPage.tsx": "Main customer management page with list display, add/edit dialogs, and detail viewing using AsyncState.",
  "frontend/src/features/customers/queries.ts": "React Query hooks for listing, fetching, creating, and updating customers via the backend actor API.",
  "frontend/src/features/customers/types.ts": "Defines customer form data structure and a helper to convert backend customers into form data.",
  "frontend/src/features/invoices/blobStorage.ts": "Handles client-side image upload by converting files to base64 data URLs and returning them for display.",
  "frontend/src/features/invoices/InvoiceDetailPage.tsx": "Invoice detail view handling display, payments, photo management, and editing for a single invoice.",
  "frontend/src/features/invoices/InvoiceForm.tsx": "Form for creating or updating invoices, including validation and line item management.",
  "frontend/src/features/invoices/InvoiceLineItemsEditor.tsx": "Editor for invoice line items with service selection, input fields, and per‑item updates.",
  "frontend/src/features/invoices/InvoicePhotoPreviewDialog.tsx": "Dialog that displays a full‑size preview of an invoice photo loaded from blob storage.",
  "frontend/src/features/invoices/InvoicePhotosSection.tsx": "Section for uploading, previewing, and removing before/after invoice photos with progress handling.",
  "frontend/src/features/invoices/InvoicesPage.tsx": "Main invoices page listing all invoices and providing dialogs for creating and editing them.",
  "frontend/src/features/invoices/photoTypes.ts": "Defines image upload state and validation utilities, including supported types and size limits.",
  "frontend/src/features/invoices/queries.ts": "Provides invoice and customer React Query hooks plus create and update invoice mutations with data parsing.",
  "frontend/src/features/invoices/ServiceSearchSelect.tsx": "Provides a popover-based searchable dropdown for selecting a service, including a 'None' option.",
  "frontend/src/features/invoices/SignInRequiredState.tsx": "Displays a card prompting the user to sign in via Internet Identity, showing a loading state during login.",
  "frontend/src/features/invoices/types.ts": "Defines invoice form types and helpers for currency, percentages, totals, and converting invoice data for forms.",
  "frontend/src/features/landing/LandingPage.tsx": "Renders the main landing page with navigation cards for customers, invoices, work orders, and services.",
  "frontend/src/features/reports/invoiceReportDateUtils.ts": "Provides helpers for converting bigint invoice timestamps to Date objects and checking if an invoice falls within a date range.",
  "frontend/src/features/reports/InvoicesReportFilters.tsx": "Implements filters for invoice reports including status, customer, and date range with a clear-all option.",
  "frontend/src/features/reports/InvoicesReportPage.tsx": "Renders the invoices report page, handling authentication, data loading, filters, and passing filtered data to the report content component.",
  "frontend/src/features/services/importParsing.ts": "Parses CSV/TSV service data into structured rows with validation for required fields and currency formatting.",
  "frontend/src/features/services/queries.ts": "Provides React Query hooks for listing, reading, creating, updating, and bulk‑importing services via the backend actor.",
  "frontend/src/features/services/ServiceBulkImportDialog.tsx": "Implements a dialog for bulk importing services via pasted text or uploaded files, showing parsed previews and handling import mutations.",
  "frontend/src/features/services/ServiceEditForm.tsx": "Form for editing an existing service, validating input, formatting currency, and submitting updates via mutation.",
  "frontend/src/features/services/ServiceEditPage.tsx": "Page for loading a service by ID and rendering the edit form with loading/error states and navigation handling.",
  "frontend/src/features/services/ServiceItemForm.tsx": "Form for creating a new service with validation and mutation submission, resetting fields on success.",
  "frontend/src/features/services/ServicesPage.tsx": "Main services listing page with add/import dialogs, data loading states, and navigation to edit individual services.",
  "frontend/src/features/services/types.ts": "Defines form and import row types for services plus helpers for parsing and formatting currency values.",
  "frontend/src/features/workOrders/queries.ts": "Defines React Query hooks for fetching, creating, updating, and modifying work orders and related customer data.",
  "frontend/src/features/workOrders/types.ts": "Provides form data types and helpers to convert between form data, backend inputs, and serialized notes.",
  "frontend/src/features/workOrders/WorkOrderCreateDialog.tsx": "UI dialog for creating a work order with validation, customer selection, and backend submission.",
  "frontend/src/features/workOrders/WorkOrderDetailPage.tsx": "Displays and edits a work order, handling loading states, photo operations, and form synchronization.",
  "frontend/src/features/workOrders/WorkOrderPhotosSection.tsx": "Manages uploading, previewing, and deleting work order photos with validation and progress tracking.",
  "frontend/src/features/workOrders/WorkOrderSheetForm.tsx": "Form component for editing detailed work order fields including instrument info and tuning data.",
  "frontend/src/features/workOrders/WorkOrdersPage.tsx": "Displays the work orders list with authentication gating, async states, and navigation to individual work orders.",
  "frontend/src/features/workOrders/WorkOrdersSignInRequiredState.tsx": "Shows a sign-in prompt UI using Internet Identity when the user is not authenticated.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on the user’s identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAuthStatus.ts": "Returns whether the user is authenticated along with initialization state and identity info.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements the Internet Identity context, handling login, stored identities, delegation validation, and status management.",
  "frontend/src/index.css": "Defines Tailwind base styles and theme variables including light/dark palettes and invoice watermark styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routes), persist them in sessionStorage, and clear them from the URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color tokens, fonts, animations, and plugin setup.",
  "project_state.json": "Captures the project’s current ICP app state, features, architecture notes, known issues, and generated assets metadata."
}