{
  "backend/main.mo": "Motoko canister implementing customer and invoice storage with CRUD operations and payment tracking.",
  "feature_evidence.json": "Feature evidence report listing branding-related updates, affected frontend files, and associated metadata.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend components and utilities.",
  "frontend/index.css": "Tailwind base and custom OKLCH color variables defining the app’s light and dark theme styles.",
  "frontend/index.html": "Main HTML entry with favicon links and script loading the React application.",
  "frontend/src/api/backendClient.ts": "Backend client type import plus a helper to normalize errors into user-friendly messages.",
  "frontend/src/api/queryKeys.ts": "Defines stable React Query keys for customers and invoices.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for invoices and customers wrapped in theme and layout providers.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper providing header, navigation, main content area, and footer branding.",
  "frontend/src/components/AsyncState.tsx": "UI helper component for loading, error, empty, and normal data states.",
  "frontend/src/components/BrandHeader.tsx": "Header displaying the Queen Bee branding with a generated logo image and title text.",
  "frontend/src/features/customers/CustomerForm.tsx": "Form for creating customers with validation, toast notifications, and mutation handling.",
  "frontend/src/features/customers/CustomersPage.tsx": "Displays customer list with async loading states and provides a dialog for adding new customers.",
  "frontend/src/features/customers/queries.ts": "React Query hooks for fetching customers, fetching a single customer, and creating new customers with cache invalidation.",
  "frontend/src/features/customers/types.ts": "Defines CustomerFormData and helpers for converting backend customer data to form data.",
  "frontend/src/features/invoices/InvoiceDetailPage.tsx": "Shows detailed invoice info, related customer data, and allows recording payments with validation.",
  "frontend/src/features/invoices/InvoiceForm.tsx": "Form for creating invoices, selecting a customer, editing line items, validating input, and submitting via mutation.",
  "frontend/src/features/invoices/InvoiceLineItemsEditor.tsx": "Editor for invoice line items allowing adding, removing, and updating items with live total calculation.",
  "frontend/src/features/invoices/InvoicesPage.tsx": "Lists all invoices with status and customer names, provides creation dialog, and handles async loading states.",
  "frontend/src/features/invoices/queries.ts": "React Query hooks for fetching invoices/customers and creating invoices or recording payments using the authenticated actor.",
  "frontend/src/features/invoices/types.ts": "Defines invoice form data structures and helper functions for currency formatting, parsing, and total calculations.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and logic for Internet Identity authentication, including loading, login, logout, and identity state management.",
  "frontend/src/index.css": "Tailwind base styles and custom OKLCH theme variables for light and dark mode UI theming.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider and mounts the root component.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, fonts, animations, and plugins.",
  "project_state.json": "Metadata describing the project state, existing features, and high-level summary of the app’s structure and functionality."
}