{
  "kind": "build_request",
  "title": "Fix app loading error on startup",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Investigate and fix the runtime “loading error” that prevents the React app from rendering, prioritizing startup-time crashes in the authentication/bootstrap layer (e.g., Internet Identity provider initialization). Ensure the app loads to the main route without a blank screen or uncaught exception.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Fix loading error"
        ]
      },
      "acceptanceCriteria": [
        "Opening the app renders the AppShell and the default route (Invoices page) without a blank screen.",
        "No uncaught exceptions occur during initial page load in the browser console."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Remove/replace any Node-only environment access that can crash in the browser (notably `process.env` usage in the frontend). Specifically ensure Internet Identity configuration does not reference `process.env.*` at runtime in Vite/React, and provide a safe fallback identity provider URL when configuration is missing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Fix loading error"
        ]
      },
      "acceptanceCriteria": [
        "Frontend code no longer relies on `process.env` at runtime (e.g., `process.env.II_URL`) in browser bundles.",
        "If an II URL is not configured, the app still loads and uses a documented safe default (or shows a clear in-app error state without crashing).",
        "Internet Identity login flow can still be initiated (no immediate error thrown on page load)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a user-visible, non-crashing error presentation for initialization/authentication failures so users are not stuck on an indefinite loading state. Reuse existing UI patterns (e.g., `AsyncState`) to show an actionable message and retry guidance when initialization fails.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Fix loading error"
        ]
      },
      "acceptanceCriteria": [
        "If Internet Identity initialization fails, the UI shows an error message in the page (not only console) and the app remains interactive.",
        "The error state includes clear English user-facing text and a retry action or instructions."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn components are read-only and must be composed, not modified).",
    "Do not edit immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx (compose/work around them if changes are needed).",
    "Backend must remain a single Motoko actor in backend/main.mo; only add migration.mo if state schema changes (not expected for this fix)."
  ],
  "nonGoals": [
    "No new product features (dashboards, new pages, new entities) beyond fixing the loading error and improving related error handling.",
    "No changes to customer/invoice data models or persistence unless the loading error root cause requires it (unlikely)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}