{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix frontend deployment blockers and improve failure diagnostics",
  "requirements": [
    {
      "id": "REQ-15",
      "summary": "Ensure the frontend builds/deploys cleanly and surface complete error details for faster diagnosis when deploy/runtime initialization fails.",
      "acceptanceCriteria": [
        "A new build + deploy attempt completes without errors.",
        "If the deploy fails again, the full error output (including stack trace/log lines) is captured and surfaced in the deployment output for diagnosis.",
        "After the fix, `dfx deploy` (or the platform’s equivalent deployment command) succeeds for both backend and frontend artifacts."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/queen-bee-app-icon.dim_180x180.png",
          "operation": "create",
          "description": "Add the generated app icon to the public assets directory so static asset packaging during deploy can find it (referenced by frontend/src/components/BrandHeader.tsx)."
        },
        {
          "path": "frontend/public/assets/generated/queen-bee-favicon.dim_32x32.png",
          "operation": "create",
          "description": "Add the generated 32x32 favicon to the public assets directory so static asset packaging during deploy can find it (referenced by frontend/index.html)."
        },
        {
          "path": "frontend/public/assets/generated/queen-bee-favicon.dim_48x48.png",
          "operation": "create",
          "description": "Add the generated 48x48 favicon to the public assets directory so static asset packaging during deploy can find it (referenced by frontend/index.html)."
        },
        {
          "path": "frontend/public/assets/generated/queen-bee-guitar-repair-logo.dim_512x512.png",
          "operation": "create",
          "description": "Add the generated logo image to the public assets directory so static asset packaging during deploy can find it (general branding usage)."
        },
        {
          "path": "frontend/public/assets/generated/queen-bee-header-banner.dim_1600x400.png",
          "operation": "create",
          "description": "Add the generated header banner to the public assets directory so static asset packaging during deploy can find it (branding usage where applicable)."
        },
        {
          "path": "frontend/public/assets/generated/queen-bee-icons.dim_256x256.png",
          "operation": "create",
          "description": "Add the generated icons image to the public assets directory so static asset packaging during deploy can find it (branding usage where applicable)."
        },
        {
          "path": "frontend/public/assets/generated/queen-bee-invoice-logo.dim_512x512.png",
          "operation": "create",
          "description": "Add the generated invoice logo to the public assets directory so static asset packaging during deploy can find it (referenced by frontend/src/config/invoiceAssets.ts)."
        },
        {
          "path": "frontend/public/assets/generated/queen-bee-invoice-watermark.dim_1200x1200.png",
          "operation": "create",
          "description": "Add the generated invoice watermark to the public assets directory so static asset packaging during deploy can find it (referenced by frontend/src/config/invoiceAssets.ts and frontend/src/index.css)."
        },
        {
          "path": "frontend/src/api/backendClient.ts",
          "operation": "modify",
          "description": "Improve error normalization so technical details always retain the raw error text and (when available) stack trace, enabling complete copy/paste diagnostics when backend calls fail during or after deploy."
        },
        {
          "path": "frontend/src/components/AsyncState.tsx",
          "operation": "modify",
          "description": "Expand the existing technical-details UI to display and copy the full raw error text (and stack when present), not just request/canister/method fields, so failures include all diagnostic log lines for troubleshooting."
        },
        {
          "path": "frontend/src/components/StartupErrorBoundary.tsx",
          "operation": "modify",
          "description": "Enhance startup failure rendering to show/copy full error message plus stack and ensure console logging includes full errorInfo, improving the ability to capture complete failure output when the app cannot initialize after deployment."
        }
      ]
    }
  ]
}