{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix React startup loading error and add resilient initialization UX",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Eliminate startup-time crashes in the authentication/bootstrap layer so the app renders AppShell and the default Invoices route without a blank screen.",
      "acceptanceCriteria": [
        "Opening the app renders the AppShell and the default route (Invoices page) without a blank screen.",
        "No uncaught exceptions occur during initial page load in the browser console."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/StartupErrorBoundary.tsx",
          "operation": "create",
          "description": "Add a lightweight React error boundary that catches unexpected startup/render errors (including auth/bootstrap-related ones) and shows a user-visible, non-crashing fallback UI so the app never stays blank."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wrap the root layout tree (ThemeProvider/AppShell/Outlet) with the new StartupErrorBoundary so any uncaught render-time exceptions during initial load are handled and do not prevent the main route from displaying."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Remove/replace Node-only environment access (process.env) from causing browser crashes; provide a safe fallback Internet Identity provider URL when missing.",
      "acceptanceCriteria": [
        "Frontend code no longer relies on `process.env` at runtime (e.g., `process.env.II_URL`) in browser bundles.",
        "If an II URL is not configured, the app still loads and uses a documented safe default (or shows a clear in-app error state without crashing).",
        "Internet Identity login flow can still be initiated (no immediate error thrown on page load)."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Add a minimal pre-React bootstrap shim (executed before /src/main.tsx) that prevents `process is not defined` at module evaluation time and supplies a documented safe default II URL when no configuration is present, ensuring the Internet Identity provider initialization cannot crash on startup."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Present non-crashing, user-visible error UI for initialization/authentication failures with retry guidance, reusing existing AsyncState patterns.",
      "acceptanceCriteria": [
        "If Internet Identity initialization fails, the UI shows an error message in the page (not only console) and the app remains interactive.",
        "The error state includes clear English user-facing text and a retry action or instructions."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BootstrapGate.tsx",
          "operation": "create",
          "description": "Create a bootstrap/auth gate component that reads Internet Identity initialization/auth status and, on failure, renders an in-page error state using the existing AsyncState component with clear instructions and a retry action (e.g., reload) instead of allowing an indefinite loading/blank experience."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Integrate BootstrapGate into the root route layout so initialization/auth failures are surfaced within the normal app chrome (AppShell) while keeping navigation and the app interactive. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}