{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Invoice UI branding: add Queen Bee logo + watermark assets and display on invoice detail",
  "requirements": [
    {
      "id": "REQ-6",
      "summary": "Generate and commit invoice logo + watermark static assets from the uploaded Queen Bee image",
      "acceptanceCriteria": [
        "Two new static assets exist in frontend/public/assets/generated and are committed: (1) an invoice logo image suitable for headers, and (2) a watermark image suitable for use as a faint background.",
        "Assets are optimized for web use (transparent background preserved if present; otherwise background is removed/converted to transparent where possible).",
        "Assets can be referenced via absolute paths like /assets/generated/<filename>."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/queen-bee-invoice-logo.dim_512x512.png",
          "operation": "create",
          "description": "Add the generated invoice logo asset extracted from the uploaded \"Queen Bee Guitar Repair 3-1.png\" with transparent background and high-contrast black styling, optimized for web use."
        },
        {
          "path": "frontend/public/assets/generated/queen-bee-invoice-watermark.dim_1200x1200.png",
          "operation": "create",
          "description": "Add the generated invoice watermark asset (faint, transparent) derived from the same mark, optimized for background use and web delivery."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Display the new invoice logo near the invoice heading on invoice detail view",
      "acceptanceCriteria": [
        "InvoiceDetailPage displays the new logo near the invoice heading (e.g., next to \"Invoice #....\") without layout breakage on mobile and desktop.",
        "Logo includes appropriate alt text in English.",
        "Logo renders crisply (no obvious distortion) and does not overlap other UI elements."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/invoiceAssets.ts",
          "operation": "create",
          "description": "Add a small config module exporting absolute static-asset paths and alt text for the invoice logo/watermark (e.g., referencing frontend/public/assets/generated/queen-bee-invoice-logo.dim_512x512.png)."
        },
        {
          "path": "frontend/src/features/invoices/InvoiceDetailPage.tsx",
          "operation": "modify",
          "description": "Render the invoice logo image (from invoiceAssets config) next to the invoice heading in both the authenticated and sign-in-required header blocks; ensure responsive sizing, consistent alignment, and English alt text."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Add a faint, non-interactive watermark behind the invoice detail content area (line items + totals)",
      "acceptanceCriteria": [
        "InvoiceDetailPage shows the watermark behind the invoice content area with low opacity and non-intrusive positioning (e.g., centered or bottom-right).",
        "Watermark is non-interactive (does not capture clicks) and does not interfere with scrolling or dialogs.",
        "Text contrast and table readability remain acceptable in both light and dark themes.",
        "If the user prints the page (browser print), the watermark remains faint and positioned sensibly (no tiling artifacts)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add a reusable CSS class (e.g., using a ::before pseudo-element) to paint a single, no-repeat background watermark image using frontend/public/assets/generated/queen-bee-invoice-watermark.dim_1200x1200.png with pointer-events disabled, low opacity, sensible positioning, and print-specific adjustments to avoid tiling and preserve faintness in print."
        },
        {
          "path": "frontend/src/features/invoices/InvoiceDetailPage.tsx",
          "operation": "modify",
          "description": "Apply the watermark wrapper class to the invoice main content area for line items + totals (the Line Items card content region), ensuring the watermark stays behind all text/controls and does not affect interactions or layout."
        }
      ]
    }
  ]
}